Repository: NikitaNaumenko/hexlet_basics
Catalog: services/app/priv/gettext/*/LC_MESSAGES/default.po
Languages: ru

source: Start
ru: Начать

source: Failed to authenticate.
ru: Ошибка аутентификации

source: Require auth
ru: Требуется аутентификация

source: Sign In
ru: Войти

source: Sign Out
ru: Выйти

source: Successfully authenticated.
ru: Вы авторизовались

source: You did it!
ru: Вы прошли все доступные упражнения. Скоро появятся новые.

source: You have been logged out!
ru: Вы вышли

source: Exercise available only for signed in users
ru: Упражнение доступно только для авторизованных пользователей

source: discuss
ru: Обсуждение

source: instructions
ru: Задание

source: lesson
ru: Урок

source: Code Basics
ru: Основы программирования

source: Continue Learning
ru: Продолжить обучение

source: Start learning
ru: Начать обучение

source: Blog
ru: Блог

source: Chat
ru: Чат сообщества

source: Guides
ru: Гайды

source: Matrix
ru: Матрица компетентности

source: Projects
ru: Проекты

source: Recommended Books
ru: Рекомендуемые книги

source: Source code
ru: Исходный код

source: tips
ru: Советы

source: definitions
ru: Определения

source: Credits
ru: При поддержке сообщества Хекслет.

source: All lessons completed!
ru: Все уроки завершены!

source: Code Basics Description
ru: Бесплатные практические уроки по программированию для тех, кто начинает с нуля

source: Code Basics Author
ru: Кирилл Мокевнин, Рахим Давлеткалиев, Наталия Басс

source: Code Basics Title
ru: Code Basics: основы программирования

source: From the creators of Hexlet
ru: От создателей Хекслета

source: About
ru: О проекте

source: Only for signed users
ru: Упражнение доступно только авторизованным пользователям.

source: Please Sign In
ru: Пожалуйста, авторизуйтесь с помощью учётной записи GitHub, это необходимо для отслеживания прогресса выполнения уроков. Если у вас ещё нет учётной записи, то сейчас самое время создать аккаунт на GitHub.

source: Donate
ru: Поддержать проект

source: Support Code Basics
ru: Цель Code Basics — предоставить качественные интерактивные уроки по основам программирования бесплатно, для всех. Вы можете поддержать проект и помочь нам развивать его, создавать новые уроки и курсы.

source: Continue
ru: Продолжить

source: issues
ru: Нашли ошибку? Есть что добавить? Пулреквесты приветствуются

source: Contributions
ru: Исходный код платформы Code Basics, всех уроков и упражнений доступен на Github. Вы можете поучаствовать в процессе улучшения уроков, исправления неточностей и расширения курсов на другие языки программирования.

source: Extended credits
ru: Идея, учебный план, платформа: Кирилл Мокевнин. Уроки (9 базовых модулей): Рахим Давлеткалиев и Наталия Басс. Расширения и адаптация: Кирилл Мокевнин, Улугбек Туйчиев, Алексей Пыльцын и другие участники сообщества Хекслет.

source: Projects goal
ru: Цель Code Basics — предоставить качественные интерактивные уроки по основам программирования бесплатно, для всех.

source: OG title php
ru: Code Basics: основы программирования на PHP

source: OG description php
ru: Изучение программирования — непростой и длительный процесс. Изучение синтаксиса языка — самая простая и короткая часть в пути, но без неё невозможно начать. Этот курс посвящен азам написания программ на PHP. Он готовит плацдарм для написания осмысленных программ

source: OG title javascript
ru: Code Basics: основы программирования на Javascript

source: OG description javascript
ru: Изучение программирования — непростой и длительный процесс. Изучение синтаксиса языка — самая простая и короткая часть в пути, но без неё невозможно начать. Этот курс посвящен азам написания программ на Javascript. Он готовит плацдарм для написания осмысленных программ

source: OG title python
ru: Code Basics: основы программирования на Python

source: OG description python
ru: Изучение программирования — непростой и длительный процесс. Изучение синтаксиса языка — самая простая и короткая часть в пути, но без неё невозможно начать. Этот курс посвящен азам написания программ на Python. Он готовит плацдарм для написания осмысленных программ

source: OG title racket
ru: Code Basics: основы программирования на Racket

source: OG description racket
ru: Racket относится к семейству Lisp-языков. Эти языки настолько не похожи на все остальное, что даже опытным программистам приходится изучать их с самых основ. Этот модуль посвящен знакомству с синтаксисом и концепциями лежащими в основе любого лиспа.

source: OG title java
ru: Code Basics: основы программирования на Java

source: OG description java
ru: Изучение программирования — непростой и длительный процесс. Изучение синтаксиса языка — самая простая и короткая часть в пути, но без неё невозможно начать. Этот курс посвящен азам написания программ на Java. Он готовит плацдарм для написания осмысленных программ

source: Terms of Service
ru: Условия использования

source: ToS Agree
ru: При использовании наших материалов и услуг, вы соглашаетесь соблюдать правила и пользовательское соглашение, изложенное ниже.

source: ToS Rules title
ru: Правила

source: ToS Rules community
ru: Курсы, сообщество и общение

source: ToS Rules question
ru: Раздел «вопросы» в уроках предназначен для вопросов по содержанию урока, упражнения или теста.

source: ToS Rules discuss
ru: В обсуждениях могут участвовать все пользователи, не только менторы.

source: ToS Rules copyright
ru: В форумах и чатах запрещена пропаганда пиратства и распространение контента, нарушающего авторские права.

source: ToS Rules abuse
ru: В форумах и чатах запрещены прямые или косвенные оскорбления.

source: ToS Rules slack
ru: Чат

source: ToS Rules slack general
ru: Основной канал чата #general предназначен для общих тем, связанных с программированием, обучением и карьерой.

source: ToS Rules slack specific question
ru: Для обсуждений конкретных вопросов, связанных со спецификой языков и технологий, используются тематические каналы.

source: ToS Account title
ru: Условия использования учетной записи

source: ToS Account age
ru: Ваш возраст должен быть 13 лет или больше для пользования этим сервисом.

source: ToS Account be a human
ru: Вы должны быть человеком. Аккаунты, зарегистрированные `ботами` или с использованием других автоматических методов недопустимы.

source: ToS Account valid email
ru: Вы должны предоставить действующий адрес электронной почты и любую другую информацию, запрашиваемую в целях завершения регистрации.

source: ToS Account uniq
ru: Ваша учётная запись должна быть уникальной. Не допускается использование одной учетной записи несколькими людьми. Вы можете создавать отдельные учётные записи для такого количества людей, которое вам необходимо в рамках ваших целей.

source: ToS Account security
ru: Вы ответственны за безопасность вашего аккаунта и пароля. Hexlet не может быть и не будет ответственен за какие-либо убытки или ущерб, нанесённые несоблюдением правил безопасности.

source: ToS Account responsibility
ru: Вы ответственны за все размещённые материалы и активность, которые публикуются через ваш аккаунт (даже если содержание было размещено другими людьми через вашу учётную запись, у которых есть своя учётная запись).

source: ToS Account single account
ru: Один человек или юридеское лицо не могут иметь более одного свободного аккаунта.

source: ToS Account illegaly
ru: Вы не можете пользоваться сервисом в любых незаконных или несанкционированных целях. Вы не должны, при использовании сервиса, нарушать какие-либо законы в вашей юрисдикции (включая, но не ограничиваясь авторским правом или законом о товарных знаках).

source: ToS Termination Account title
ru: Отмена и прекращение действия аккаунта

source: ToS Termination Account responsibility
ru: Вы несёте полную ответственность за удаление вашего аккаунта. Вы можете удалить свой аккаунт в любое время, обратившись в поддержку по электронной почте.

source: ToS Termination Account ban reasons
ru: Hexlet имеет право на немедленную отмену услуг без предупреждения в случаях:

source: ToS Termination Account ban reason violation of conditions
ru: Компания решила, что вы нарушили данные Условия;

source: ToS Termination Account ban reason cheating
ru: Компании подозревает вас во вредоносных, мошеннических или нелегальных действиях.

source: ToS Termination Account ban
ru: Hexlet имеет право на немедленную отмену услуг.

source: ToS Change services and price title
ru: Изменения услуг и цены

source: ToS Change services and price changes
ru: Hexlet оставляет за собой право в любое время изменить или приостановить, временно или постоянно, Услуги (или любую их часть) с предварительным уведомлением или без него. Например, сайт может быть временно отключен для обслуживания.

source: ToS Change services and price no responsibility
ru: Hexlet не несёт ответственности перед вами или любой третьей стороной за любые модификации, изменения цен, приостановление или прекращение Услуг сайта.

source: ToS Copyright title
ru: Авторское право

source: ToS Copyright design
ru: Стиль оформления сайта охраняется авторским правом © 2014 Hexlet Ltd. Все права защищены. Не допускается дублирование, копирование или повторное использование любой части HTML/CSS, JavaScript, визуальных элементов дизайна или концепции без письменного разрешения Hexlet.

source: ToS Copyright lessons
ru: Статус авторских прав для каждого урока, созданного авторами, не являющимися штатными сотрудниками компании Hexlet Ltd., в том числе для видео, текста и кода, определяется на индивидуальной основе авторами и администрацией Hexlet.

source: ToS Copyright authors
ru: Авторские права на все уроки, созданные авторами, являющимися штатными сотрудниками компании Hexlet Ltd., в том числе для видео, текста и кода, принадлежат компании Hexlet Ltd.

source: ToS Copyright permission
ru: Вы четко понимаете и соглашаетесь с тем, что вся информация, представленная на сайте, в том числе видео, звук, текст, код, оформление, графический дизайн, иллюстрации и другое содержание страниц, защищено законом об авторском праве. Вы принимаете все ограничения, связанные с законом об авторском праве, и не имеете права копировать, модифицировать, переводить, публиковать, транслировать, передавать, продавать или распространять информацию без прямого письменного разрешения администрации компании Hexlet Ltd и владельца авторского права.

source: ToS General title
ru: Общие условия

source: ToS General using
ru: Вы пользуетесь сайтом на свой собственный риск. Услуги предоставляются на условиях `как есть` и `по мере доступности`.

source: ToS General support
ru: Поддержка Hexlet доступна только на английском и русском языках, по электронной почте.

source: ToS General fishing
ru: Вы не в праве изменять, адаптировать или взламывать Услуги сайта или изменять другой сайт так, что сторонний сервис будет ложно восприниматься, как имеющий отношение к Услугам, Hexlet или любому его сервису.

source: ToS General threats
ru: Словесные, физические, письменные или другие злоупотребления (включая угрозы применения силы или мести) в сторону подписчика, сотрудника, пользователя или руководителя немедленно приведут к удалению аккаунта.

source: ToS General spam
ru: Вы не в праве загружать, публиковать, размещать или передавать нежелательные почтовые сообщения, смс, или `спам`.

source: ToS General malicious code
ru: Вы не в праве пересылать вирусы, вирусных червей или любой другой код, способный нанести ущерб.

source: ToS General using services
ru: Вы понимаете, что Hexlet использует сторонних поставщиков и хостинг-партнеров, чтобы обеспечить необходимое оборудование, программное обеспечение, сети, хранение и связанные с ними технологии, необходимые для эксплуатации сайта.

source: ToS General ide
ru: Упражнения по программированию и разработке приложений на Code Basics рассчитаны на выполнение заданий внутри среды, созданной автором курса. Если ваше решение включает в себя не авторизованные сторонние компоненты, Hexlet не гарантирует функциональность такого подхода и не предоставляет поддержку в таких случаях.

source: ToS General traffic
ru: Если генерируемый вами трафик значительно превышает средний уровень (определяется исключительно администрацией Hexlet) других пользователей, мы оставляем за собой право немедленно отключить вашу учетную запись, или ограничить доступ к сервисам до момента уменьшения генерируемого вами трафика.

source: ToS General does not guarantee
ru: Hexlet не гарантирует, что (I) услуги будут отвечать вашим требованиям, (II) будут предоставляться непрерывно, быстро, безопасно и без ошибок, (III) результаты, которые могут быть получены при использовании сервиса будут точными и надежными, (IV) качество любых продуктов, услуг, информации или других материалов, приобретенных или полученных вами с помощью сайта, будет соответствовать вашим ожиданиям, и (v) любые ошибки на сайте будут исправлены.

source: ToS General agree
ru: Вы четко понимаете и соглашаетесь с тем, что Hexlet не несет ответственности за любой прямой, косвенный, случайный, намеренный или побочный ущерб, включая, но не ограничиваясь, ущербом за потерю прибыли, репутации, пользования, данных или других нематериальных благ (даже если Hexlet была предупреждена о возможности таких убытков).

source: ToS General questions
ru: Вопросы по Пользовательскому соглашению или любого другого содержания, должны быть направлены по адресу

source: ToS General questions languages
ru: на английском или русском языке.

source: ToS last update
ru: Последнее обновление 15 июня 2019. Основано на

source: ToS last update conditions
ru: условиях использования GitHub.

source: Privacy
ru: Политика конфиденциальности

source: Privacy about
ru: Данный документ описывает как мы собираем вашу персональную информацию, используем её и передаём другим организациям когда вы посещаете сайт https://code-basics.ru(далее `Сайт`).

source: Privacy Personal title
ru: Личная информация, которую мы собираем

source: Privacy Personal visit
ru: При посещении Сайта мы автоматически собираем определенную информацию о вашем устройстве, включая информацию о вашем веб-браузере, IP-адресе, часовом поясе и некоторых файлах cookie, установленных на вашем устройстве. Кроме того, при просмотре Сайта мы собираем информацию об отдельных веб-страницах или продуктах, которые вы просматриваете, какие веб-сайты или условия поиска ссылались на сайт, а также информацию о том, как вы взаимодействуете с Сайтом. Мы ссылаемся на эту автоматически собранную информацию как «Информация об устройстве».

source: Privacy Personal device
ru: Мы собираем информацию об устройстве, используя следующие технологии:

source: Privacy Personal cookies
ru: «Cookies» - это файлы данных, которые размещаются на вашем устройстве или компьютере и часто включают анонимный уникальный идентификатор. Дополнительные сведения о файлах cookie и способах отключения файлов cookie см. На странице

source: Privacy Personal logs
ru: «Лог-файлы» отслеживают действия, происходящие на Сайте, и собирают данные, включая ваш IP-адрес, тип браузера, поставщика услуг Интернета, страницы для ссылок / выхода и отметки даты и времени.

source: Privacy Personal beacons
ru: «Веб-маяки» (web beacons), «теги» и «пиксели» - это электронные файлы, используемые для записи информации о том, как вы просматриваете сайт.

source: Privacy Personal about
ru: Когда мы говорим о «личной информации» в этой Политике конфиденциальности, мы говорим об информации об устройстве и информации о заказе.

source: Privacy Storage title
ru: Где мы храним вашу личную информацию

source: Privacy Storage countries
ru: Мы храним вашу личную информацию на наших серверах внутри баз данных PostgreSQL и других хранилищ информации. Сервера арендуются у компаний Amazon и Microsoft и находятся в Соединенных Штатах Америки и Германии.

source: Privacy Storage personal
ru: Ваша личная информация также хранится в резервных копиях вне баз данных. Резервные копии также хранятся на серверах компаний Amazon и Microsoft и находятся в Соединенных Штатах Америки и Германии.

source: Privacy Collect title
ru: Как мы используем вашу личную информацию

source: Privacy Collect device
ru: Мы собираем и используем информацию о вашем устройстве доступа к сайту, чтобы помочь нам выявить потенциальный риск и мошенничество (в частности, ваш IP-адрес) и в целом улучшить и оптимизировать наш сайт (например, для аналитики и изучения, как наши клиенты просматривают и взаимодействуют с сайтом, а также для оценки успех наших маркетинговых и рекламных кампаний).

source: Privacy Sharing title
ru: Как мы делимся вашей личной информацией

source: Privacy Sharing third person
ru: Мы передаем вашу личную информацию третьим лицам, чтобы помочь нам использовать вашу личную информацию, как описано выше. Мы используем Rollbar чтобы следить за работоспособностью сайта. Вы можете узнать больше о том, как Rollbar использует вашу личную информацию здесь

source: Privacy Sharing pass
ru: Мы можем также передавать вашу Личную информацию в соответствии с действующими законами и правилами, отвечать на повестку в суд, ордер на обыск или другой законный запрос на получение информации, которую мы получаем, или иным образом защищать наши права.

source: Privacy Adword title
ru: Целевая реклама

source: Privacy Adword info
ru: Мы размещаем контекстную рекламу Google Adwords и Facebook, таргетируя её потенциальным клиентам. Мы используем вашу личную информацию, чтобы предоставить вам целевую рекламу или маркетинговые коммуникации, которые, по нашему мнению, могут вас заинтересовать. Для получения дополнительной информации о том, как работает таргетинг рекламы, вы можете посетить образовательную страницу Инициативы по сетевой рекламе (Network Advertising Initiative, «NAI») по адресу

source: Privacy Adword decline
ru: Вы можете отказаться от целевой рекламы:

source: Privacy Adword decline services
ru: Кроме того, вы можете отказаться от некоторых из этих услуг, посетив портал отказа от рекламы Digital Advertising Alliance по адресу:

source: Privacy Do not track
ru: Do not track

source: Privacy Do not track methods
ru: Обратите внимание, что мы не изменяем методы сбора и использования данных нашего сайта, когда мы видим сигнал Do Not Track из вашего браузера.

source: Privacy Your Rights title
ru: Ваши права

source: Privacy Your Rights european
ru: Если вы являетесь резидентом Европы, вы имеете право на доступ к личной информации, которую мы имеем о вас, и попросить нас исправить, обновить или удалить вашу личную информацию. Если вы хотите воспользоваться этим правом, пожалуйста, свяжитесь с нами через контактную информацию ниже.

source: Privacy Your Rights european additional
ru: Кроме того, если вы являетесь европейским резидентом, мы отмечаем, что мы обрабатываем вашу информацию, чтобы выполнять контракты, которые мы могли бы иметь с вами (например, если вы делаете заказ через Сайт) или иным образом преследовать наши законные деловые интересы, перечисленные выше. Кроме того, обратите внимание, что ваша информация будет передана за пределы Европы, в том числе в Соединенные Штаты.

source: Privacy Modifications
ru: Изменения

source: Privacy Modifications updates
ru: Мы можем периодически обновлять эту политику конфиденциальности, чтобы отражать, например, изменения в нашей практике или по другим операционным, правовым или нормативным причинам.

source: Privacy Contact title
ru: Связь с нами

source: Privacy Contact info
ru: Для получения дополнительной информации о наших правилах конфиденциальности, если у вас есть вопросы или вы хотите подать жалобу, пожалуйста, свяжитесь с нами по электронной почте по адресу

source: Privacy Contact info additional
ru: или по почте, используя приведенную ниже информацию:

source: Privacy Addres
ru: Puolikkotie 8, Espoo, 18, 02230, Finland

source: Privacy Hexlet
ru: c/o Hexlet

source: Privacy Last update
ru: Последнее обновление: 15.06.2019
